---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.InsulationTypeSetIterator
source: html/5fe91836-02da-5e98-969d-ad8d9d01ceae.htm
---
# InsulationTypeSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.